{"class_name": "Sequential", "keras_version": "1.2.1", "config": [{"class_name": "Lambda", "config": {"input_dtype": "float32", "output_shape_type": "raw", "output_shape": null, "name": "lambda_1", "trainable": true, "arguments": {}, "batch_input_shape": [null, 160, 320, 3], "function_type": "lambda", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0o@g\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa\u001e<ipython-input-4-d3d4e794f78a>\u00da\b<lambda>\u0004\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null]}}, {"class_name": "Cropping2D", "config": {"cropping": [[50, 20], [0, 0]], "name": "cropping2d_1", "trainable": true}}, {"class_name": "Convolution2D", "config": {"nb_col": 5, "W_regularizer": null, "dim_ordering": "tf", "bias": true, "b_constraint": null, "trainable": true, "activation": "relu", "nb_filter": 24, "name": "convolution2d_1", "activity_regularizer": null, "b_regularizer": null, "init": "glorot_uniform", "nb_row": 5, "W_constraint": null, "subsample": [2, 2], "border_mode": "valid"}}, {"class_name": "Convolution2D", "config": {"nb_col": 5, "W_regularizer": null, "dim_ordering": "tf", "bias": true, "b_constraint": null, "trainable": true, "activation": "relu", "nb_filter": 36, "name": "convolution2d_2", "activity_regularizer": null, "b_regularizer": null, "init": "glorot_uniform", "nb_row": 5, "W_constraint": null, "subsample": [2, 2], "border_mode": "valid"}}, {"class_name": "Convolution2D", "config": {"nb_col": 5, "W_regularizer": null, "dim_ordering": "tf", "bias": true, "b_constraint": null, "trainable": true, "activation": "relu", "nb_filter": 48, "name": "convolution2d_3", "activity_regularizer": null, "b_regularizer": null, "init": "glorot_uniform", "nb_row": 5, "W_constraint": null, "subsample": [2, 2], "border_mode": "valid"}}, {"class_name": "Convolution2D", "config": {"nb_col": 3, "W_regularizer": null, "dim_ordering": "tf", "bias": true, "b_constraint": null, "trainable": true, "activation": "relu", "nb_filter": 64, "name": "convolution2d_4", "activity_regularizer": null, "b_regularizer": null, "init": "glorot_uniform", "nb_row": 3, "W_constraint": null, "subsample": [1, 1], "border_mode": "valid"}}, {"class_name": "Convolution2D", "config": {"nb_col": 3, "W_regularizer": null, "dim_ordering": "tf", "bias": true, "b_constraint": null, "trainable": true, "activation": "relu", "nb_filter": 64, "name": "convolution2d_5", "activity_regularizer": null, "b_regularizer": null, "init": "glorot_uniform", "nb_row": 3, "W_constraint": null, "subsample": [1, 1], "border_mode": "valid"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"W_regularizer": null, "name": "dense_1", "input_dim": 8448, "bias": true, "b_constraint": null, "b_regularizer": null, "activation": "linear", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "W_constraint": null, "output_dim": 100}}, {"class_name": "Dense", "config": {"W_regularizer": null, "name": "dense_2", "input_dim": 100, "bias": true, "b_constraint": null, "b_regularizer": null, "activation": "linear", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "W_constraint": null, "output_dim": 50}}, {"class_name": "Dense", "config": {"W_regularizer": null, "name": "dense_3", "input_dim": 50, "bias": true, "b_constraint": null, "b_regularizer": null, "activation": "linear", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "W_constraint": null, "output_dim": 10}}, {"class_name": "Dense", "config": {"W_regularizer": null, "name": "dense_4", "input_dim": 10, "bias": true, "b_constraint": null, "b_regularizer": null, "activation": "linear", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "W_constraint": null, "output_dim": 1}}]}